# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 3 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  # s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs


# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DSAEN, [32]] # 0
  - [-1, 1, Conv, [32, 3, 2]] # 1 shape: 64 x 320 x 320 
  - [-1, 2, C3k2, [64, True, 0.25]] # 2 shape: 64 x 320 x 320

  - [-1, 1, Conv, [128, 3, 2]] # 3 shape: 128 x 160 x 160
  - [-1, 2, C3k2, [128, True, 0.25]] # 4 shape: 128 x 160 x 160

  - [-1, 1, DWConv, [256, 3, 2]] # 5 shape: 256 x 80 x 80
  - [-1, 2, C3k2, [256, True, 0.25]] # 6 shape: 256 x 80 x 80

  - [-1, 1, DWConv, [512, 3, 2]] # 7 shape: 512 x 40 x 40
  - [-1, 2, C3k2, [512, True]] # 8 shape: 512 x 40 x 40

  - [-1, 1, DWConv, [1024, 3, 2]] # 9 shape: 1024 x 20 x 20
  - [-1, 2, C3k2, [1024, True]] # 10 shape: 1024 x 20 x 20
  
  - [-1, 1, SPPF, [1024, 5]] # 11 shape: 1024 x 20 x 20
  - [-1, 2, C2PSA, [1024]] # 12 shape: 1024 x 20 x 20

# YOLO11 head
head:
  - [[4, 6, 8, 12], 1, MSCA, [128]] # 13

  - [[13], 1, Detect, [nc]] # Detect(P2, P3, P4, P5)
